ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DEVICEINI.c
/**
 *題名：初期化アプリ
 *作成者：浅尾　享一
 *初期化に必要な処理を実行するアプリケーション
**/
#include "tmpm380_DEVICEINI.h"

void DEVICE_INIT(void)
{
    OS_TSKCon1 *OS_LoadTime;/* OS設定値を読むためのポインタ構造体に名前をつける */
    OS_LoadTime = OSTSKCon1S();/* 関数経由でポインタをOSparamにアクセス */
    
    uint8_t REG_00, REG_01 = 0;/* 一時処理変数 */
    
    /* 以下、初期化アプリが実行する処理 */
    WDTCLR();/* 外部ｳｫｯﾁﾄﾞｯｸﾞﾀｲﾏのｸﾘｱ処理 */
    
    if (D_INISQ == 0) {
        /* 初回起動時動作 */
        /* ﾃﾞｨｯﾌﾟｽｲｯﾁの読み出し処理 */
        while (1) {
            /* ループここから */
            NVIC_EnableIRQ(INTTB00_IRQn);/* タイマ割り込み許可 */
            
            while (count01 < 5);/* 5ms待ちます */
            TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
            count01 = 0;/* カウントの0クリア */
            while (count01 < 5);/* 5ms待ちます */
            TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
            count01 = 0;
            WDTCLR();/* 外付けウォッチドッグタイマーのクリア */
            
            DIPBUF = (~MXIN1 & 0xF0);/* 現在ディップスイッチの値を代入する */
            
            while (count01 < 5);/* 5ms待ちます */
            TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
            count01 = 0;/* カウントの0クリア */
            while (count01 < 5);/* 5ms待ちます */
            TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
            count01 = 0;
            WDTCLR();/* 外付けウォッチドッグタイマーのクリア */
            while (count01 < 5);/* 5ms待ちます */
            TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
            count01 = 0;/* カウントの0クリア */
            while (count01 < 5);/* 5ms待ちます */
            TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
            count01 = 0;
            WDTCLR();/* 外付けウォッチドッグタイマーのクリア */
            
            if ((~MXIN1 & 0xF0) == DIPBUF) {
                /* ﾃﾞｨｯﾌﾟｽｲｯﾁの取り込みが正常である場合 */
                SYKND0 = DIPBUF;/* 機器情報に保存する */
                break;/* 抜けます */
                
            }
            
        }/* ループここまで */
        
        TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
        count01 = 0;
        WDTCLR();/* 外付けウォッチドッグタイマーのクリア */
        
        /* NV-RAMからのデータ読み出し処理 */
        SETUP();/* 読み出し処理 */
        
        ABNFO = (ABNF & 0x0F);/* オールドに保存する */
        if ((SYSFLG & 0x40) > 0) {
            /* 電源ONフラグがある場合 */
            DSPNO = 1;/* トップ画面にセット */
            
        }
        
        if ((SYSFLG & 0x02) > 0) {
            /* 運転中フラグがあった場合 */
            if (((ABNF & 0x0F) == 0) || ((ABNF & 0x0F) == 11)) {
                /* 正常で電源が入ってきた、または停電異常であった場合 */
                ABNF |= 0x0B;/* 11（0x0B）停電異常をセット */
                ABNF |= 0x80;/* ブザーフラグをON */
                STSFL0 |= 0x20;/* 準備中のフラグをセット */
                
            }/* 停電異常以外の異常であった場合はここに抜ける */
            
        }/* 運転中フラグがあった場合はここに抜ける */
        
        if ((RPAT & 0x20) > 0) {
            /* 洗浄工程中であった場合 */
            DSPSEQ = 4;/* 洗浄モードセット */
            DSPSSQ = 2;/* 洗浄工程表示をセット */
            STSFL0 |= 0x80;/* 設定モードをセット */
            
        }
        
        if (NPAT == 11) {
            /* NPATの値が11であった場合 */
            TNO = 11;/* セルフテストナンバーを11にする */
            
        }
        
        WDTCLR();/* 外付けウォッチドッグタイマーのクリア */
        TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
        count01 = 0;/* カウントクリア */
        
        /* I2CバスでRTCとDACの確認を行う処理 */
        I2C_WCNT = 0;/* I2C書込み回数をｸﾘｱ */
        I2C_RCNT = 0;/* I2C読み込み処理回数をクリア */
        I2C_STATE = 0;/* I2C割り込みｽﾃｰﾄを初回用にする */
        
        SBI_I2CState i2c_state;/* I2Cバス状態を見る構造体に名前を付ける */
        
        NVIC_EnableIRQ(INTSBI0_IRQn);/* I2C通信割り込みの許可 */
        SBI_GenerateI2CStop(TSB_SBI0);/* I2C通信のｽﾄｯﾌﾟをｾｯﾄ */
        
        i2c_state = SBI_GetI2CState(TSB_SBI0);/* I2Cバス状態取得 */
        while (i2c_state.Bit.BusState == 1) {
            /* バスビジーである場合 */
            SBI_GenerateI2CStop(TSB_SBI0);/* 最初にｽﾄｯﾌﾟｺﾝﾃﾞｨｼｮﾝをｾｯﾄ */
            while (count01 < 5);/* 5ms待つ */
            WDTCLR();/* 外付けウォッチドッグタイマーのクリア */
            TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
            count01 = 0;/* カウントクリア */
            
            I2C_RSTE();/* I2Cﾊﾞｽﾗｲﾝをｸﾘｱ */
            
            i2c_state = SBI_GetI2CState(TSB_SBI0);/* I2Cバス状態取得 */
            
        }
        
        /* RTCの初期設定などの確認処理 */
        /* ダミーリード処理 */
        T0BF1 = 0;/* 読み出しﾁｪｯｸ用にクリア */
        I2C_RCNT = 1;/* 受信回数ｾｯﾄ(直ぐにストップする処理) */
        
        i2c_state = SBI_GetI2CState(TSB_SBI0);/* I2Cバス状態取得 */
        for (uint8_t j = 0;j < 10;j++) {
            /* ダミーリードを10回トライアル */
            SBI_SetSendData(TSB_SBI0, ((RTC_ADDR) | 0x01));/* RTC読出し */
            SBI_GenerateI2CStart(TSB_SBI0);/* I2Cスタートさせる。送信終了後、割りこみ発生 */
            
            count01 = 0;/* カウントクリア */
            while (count01 < 5);/* 5ms待つ */
            count01 = 0;/* カウントクリア */
            while (count01 < 5);/* 5ms待つ */
            TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
            WDTCLR();/* 外付けウォッチドッグタイマーのクリア */
            count01 = 0;/* カウントクリア */
            
            if ((I2C_RCNT > 2) && (T0BF1 == 1)) {
                /* ダミー読出しできた場合 */
                SBI_SetI2CACK(TSB_SBI0, ENABLE);/* ACKを無効化しているため、ここで有効にする */
                break;
                
            } else {
                /* ダミー読出し出来ていない場合 */
                i2c_state = SBI_GetI2CState(TSB_SBI0);/* I2Cバス状態取得 */
                while (i2c_state.Bit.BusState == 1) {
                    /* バスビジーである場合 */
                    SBI_GenerateI2CStop(TSB_SBI0);/* 最初にｽﾄｯﾌﾟｺﾝﾃﾞｨｼｮﾝをｾｯﾄ */
                    count01 = 0;/* カウントクリア */
                    while (count01 < 5);/* 10ms待つ */ 
                    TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
                    WDTCLR();/* 外付けウォッチドッグタイマーのクリア */
                    
                    I2C_RSTE();/* I2Cﾊﾞｽﾗｲﾝをｸﾘｱ */
                    
                    i2c_state = SBI_GetI2CState(TSB_SBI0);/* I2Cバス状態取得 */
                    
                }
                
            }
            
            SBI_SetI2CACK(TSB_SBI0, ENABLE);/* ACKを無効化しているため、ここで有効にする */
            
