ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DEVICEINI.c
        }
        
        T0BF1 = 0;/* ｸﾘｱ */
        SBI_GenerateI2CStop(TSB_SBI0);/* ｽﾄｯﾌﾟｺﾝﾃﾞｨｼｮﾝをｾｯﾄ */
        
        /* VLFﾋﾞｯﾄの確認 */
        I2C_STATE = 0;/* 割り込みステート変更 */
        I2C_WCNT = 0;/* 初回書込みカウントを0リセット */
        I2C_RCNT = 0;/* 初回読込みカウントを0リセット */
        T0BF0 |= 0x02;/* 仮でVLFﾌﾗｸﾞをｾｯﾄ(RTC準備未完了の意) */
        
        count01 = 0;/* カウントクリア */
        for (uint8_t i = 0;i < 10;i++) {
            i2c_state = SBI_GetI2CState(TSB_SBI0);/* I2Cバス状態取得 */
            if (i2c_state.Bit.BusState == 1) {
                /* バスビジーである場合 */
                SBI_GenerateI2CStop(TSB_SBI0);/* ｽﾄｯﾌﾟｺﾝﾃﾞｨｼｮﾝをｾｯﾄ */
                count01 = 0;/* カウントクリア */
                while (count01 < 5);/* 5ms待つ */
                TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
                WDTCLR();/* 外付けウォッチドッグタイマーのクリア */
                count01 = 0;/* カウントクリア */
                
                I2C_RSTE();/* I2Cﾊﾞｽﾗｲﾝをｸﾘｱ */
                
            } else {
                /* バスフリー確認が出来た場合 */
                break;
                
            }
            
            if (i == 9) {
                /* 最後の場合 */
                RTC_ERR |= 0x01;/* RTC異常があったフラグをセット */
            }
            
        }
        
        i2c_state = SBI_GetI2CState(TSB_SBI0);/* I2Cバス状態取得 */
        if (i2c_state.Bit.BusState == 0) {
            /* バスフリーである場合 */
            T0BF1 = 0;/* 使用するﾊﾞｯﾌｧクリア */
            SBI_SetSendData(TSB_SBI0, ((RTC_ADDR) | 0x00));/* ダミー書込み */
            SBI_GenerateI2CStart(TSB_SBI0);/* I2Cスタートさせる。送信終了後、割りこみ発生 */
            
            count01 = 0;/* カウントクリア */
            while (count01 < 5);/* 5ms待ちます */
            TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
            count01 = 0;/* カウントクリア */
            
            i2c_state = SBI_GetI2CState(TSB_SBI0);/* I2Cバス状態取得 */
            if ((I2C_WCNT >= 2) && (i2c_state.Bit.BusState == 0)) {
                /* RTCと通信可能である場合 */
                SBI_SetSendData(TSB_SBI0, (RTC_ADDR | 0x01));/* スタート後、スレーブアドレスを送る。続いて読込み */
                SBI_GenerateI2CStart(TSB_SBI0);/* I2Cスタート状態にさせる。送信終了後、割りこみ発生 */
                count01 = 0;/* カウントクリア */
                while (count01 < 5);/* 5ms待ちます */
                TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
                WDTCLR();/* クリアー */
                count01 = 0;/* カウントクリア */
                
                if ((I2C_RCNT >= 3) && (T0BF1 == 1)) {
                    /* 受信完了した場合 */
                    RTC_ERR = 0;/* RTC異常をクリア */
                } else {
                    RTC_ERR |= 0x01;/* RTC異常があったフラグをセット */
                }
            } else {
                /* RTCと通信出来ない場合 */
                RTC_ERR |= 0x01;/* RTC異常があったフラグをセット */
            }
        } else {
            /* バスビジーである場合 */
            RTC_ERR |= 0x01;/* RTC異常があったフラグをセット */
        }
        
        SBI_SetI2CACK(TSB_SBI0, ENABLE);/* ACKを無効化しているため、ここで有効にする */
        
        while ((T0BF0 & 0x02) == 0x02) {
            /* 読出したVLFビットが1だった場合 */
            I2C_STATE = 1;/* 初回読み出し1終了 割り込みステートの変更 */
            T0BF2 = 0;/* ｸﾘｱ */
            
            /* 初期化コマンドおよび、VLFレジスタに0書き込み */
            for (;T0BF2 <= 8;T0BF2++) {
                I2C_WCNT = 0;/* 書込みカウントを0リセット */
                I2C_RCNT = 0;/* 読込みカウントを0リセット */
                /* I2Cバス状態の確認を行う */
                count01 = 0;/* カウントクリア */
                while (count01 < 5);/* 5ms待つ */
                TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
                WDTCLR();/* WDT clear */
                count01 = 0;/* カウントクリア */
                
                i2c_state = SBI_GetI2CState(TSB_SBI0);/* I2Cバス状態取得 */
                if (i2c_state.Bit.BusState == 1) {
                    /* バスビジーである場合 */
                    SBI_GenerateI2CStop(TSB_SBI0);/* 最初にｽﾄｯﾌﾟｺﾝﾃﾞｨｼｮﾝをｾｯﾄ */
                    count01 = 0;/* カウントクリア */
                    while (count01 < 5);/* 5ms待つ */
                    TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
                    WDTCLR();/* WDT clear */
                    count01 = 0;/* カウントクリア */
                    
                }
                
                i2c_state = SBI_GetI2CState(TSB_SBI0);/* I2Cバス状態取得 */
                if (i2c_state.Bit.BusState == 0) {
                    /* バスフリーである場合 */
                    SBI_SetSendData(TSB_SBI0, ((RTC_ADDR) | 0x00));/* RTCへ書込み */
                    SBI_GenerateI2CStart(TSB_SBI0);/* I2Cスタートさせる。送信終了後、割りこみ発生 */
                    
                    count01 = 0;/* カウントクリア */
                    for (uint8_t i = 0;i < 4;i++) {
                        /* 20ms待つ処理 */
                        while (count01 < 5);/* 5ms待つ */
                        TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
                        WDTCLR();/* WDT clear */
                        count01 = 0;/* カウントクリア */
                        
                    }
                    
                    if (I2C_WCNT >= 2) {
                        /* 書き込み完了である場合 */
                        RTC_ERR = 0;/* ｸﾘｱｰ */
                    } else {
                        RTC_ERR |= 0x01;/* RTC通信異常をセット */
                    }
                } else {
                    /* バスフリーにならない場合 */
                    RTC_ERR |= 0x01;/* RTC通信異常をセット */
                }
            }
            
            I2C_STATE = 0;/* 割り込みステートの変更 */
            I2C_WCNT = 0;/* 初回書込みカウントを0リセット */
            I2C_RCNT = 0;/* 初回読込みカウントを0リセット */
            T0BF0 |= 0x02;/* 仮でVLFﾌﾗｸﾞｾｯﾄ */
            
            i2c_state = SBI_GetI2CState(TSB_SBI0);/* I2Cバス状態取得 */
            while (i2c_state.Bit.BusState == 1) {
                /* バスビジーである場合は繰り返し */
                SBI_GenerateI2CStop(TSB_SBI0);/* ｽﾄｯﾌﾟｺﾝﾃﾞｨｼｮﾝをｾｯﾄ */
                count01 = 0;/* カウントクリア */
                while (count01 < 5);/* 5ms待つ */
                TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
                WDTCLR();/* WD clear */
                count01 = 0;/* カウントクリア */
                i2c_state = SBI_GetI2CState(TSB_SBI0);/* I2Cバス状態取得 */
                
