ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DEVICEINI.c
            }
            
            i2c_state = SBI_GetI2CState(TSB_SBI0);/* I2Cバス状態取得 */
            if (i2c_state.Bit.BusState == 0) {
                /* バスフリーである場合 */
                T0BF1 = 0;/* 使用するﾊﾞｯﾌｧクリア */
                SBI_SetSendData(TSB_SBI0, ((RTC_ADDR) | 0x00));/* ダミー書込み */
                SBI_GenerateI2CStart(TSB_SBI0);/* I2Cスタートさせる。送信終了後、割りこみ発生 */
                
                count01 = 0;/* カウントクリア */
                while (count01 < 5);/* 5ms待つ */
                count01 = 0;/* カウントクリア */
                while (count01 < 5);/* 5ms待つ */
                
                TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
                WDTCLR();/* WDT clear */
                count01 = 0;/* カウントクリア */
                i2c_state = SBI_GetI2CState(TSB_SBI0);/* I2Cバス状態取得 */
                
                if ((I2C_WCNT >= 2) && (i2c_state.Bit.BusState == 0)) {
                    /* RTCと通信可能である場合 */
                    SBI_SetSendData(TSB_SBI0, (RTC_ADDR | 0x01));/* スタート後、スレーブアドレスを送る。(読込み) */
                    SBI_GenerateI2CStart(TSB_SBI0);/* I2Cスタート状態にさせる。送信終了後、割りこみ発生 */
                    count01 = 0;/* カウントクリア */
                    while (count01 < 5);/* 5ms待つ */
                    count01 = 0;/* カウントクリア */
                    while (count01 < 5);/* 5ms待つ */
                    
                    TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
                    WDTCLR();/* WDT clear */
                    count01 = 0;/* カウントクリア */
                    
                    if ((I2C_RCNT >= 3) && (T0BF1 == 1)) {
                        /* 受信完了した場合 */
                        RTC_ERR = 0;
                    } else {
                        RTC_ERR |= 0x01;
                    }
                } else {
                    /* RTCと通信出来ない場合 */
                    RTC_ERR |= 0x01;
                }
            } else {
                /* バスビジーである場合 */
                RTC_ERR |= 0x01;
            }
            
            SBI_SetI2CACK(TSB_SBI0, ENABLE);/* ACKを無効化しているため、ここで有効にする */
            
            if ((RTC_ERR & 0x01) == 0x01) {
                /* 通信不良があった場合は抜けます */
                break;
            }
            
        }/* ループここまで */
        
        I2C_STATE = 2;/* 初回RTC状態確認終了 割り込みステートの変更 */
        i2c_state = SBI_GetI2CState(TSB_SBI0);/* I2Cバス状態取得 */
        /* ↓RTCのレジスタに設定値を入力していく↓ */
        if (i2c_state.Bit.BusState == 1) {
            /* バスビジーである場合 */
            SBI_GenerateI2CStop(TSB_SBI0);/* I2C通信終了をｾｯﾄ */
            count01 = 0;/* カウントクリア */
            while (count01 < 5);/* 5ms待つ */
            TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
            WDTCLR();/* WDT clear */
            count01 = 0;/* カウントクリア */
            
        }
        T0BF0 = 0;/* 初期化用作業領域のクリア */
        
        if ((RTC_ERR & 0x01) == 0x00) {
            /* バスフリーである場合 */
            for (;T0BF0 <= 6; T0BF0++) {
                I2C_WCNT = 0;/* 初回書込みカウントを0リセット */
                I2C_RCNT = 0;/* 初回読込みカウを0リセット */
                /* 待ちます */
                count01 = 0;/* カウントクリア */
                while (count01 < 5);/* 5ms待つ */
                TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
                WDTCLR();/* WDT clear */
                count01 = 0;/* カウントクリア */
                
                /* I2Cバス状態の確認を行う */
                i2c_state = SBI_GetI2CState(TSB_SBI0);/* I2Cバス状態取得 */
                if (i2c_state.Bit.BusState == 0) {
                    /* I2Cバスの状態確認(利用可になるまで繰り返す) */
                    SBI_SetSendData(TSB_SBI0, ((RTC_ADDR) | 0x00));/* RTCへ書込み */
                    SBI_GenerateI2CStart(TSB_SBI0);/* I2Cスタートさせる。送信終了後、割りこみ発生 */
                    count01 = 0;/* カウントクリア */
                    while (count01 < 5);/* 5ms待つ */
                    count01 = 0;/* カウントクリア */
                    while (count01 < 5);/* 5ms待つ */
                    
                    TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
                    WDTCLR();/* WDT clear */
                    count01 = 0;/* カウントクリア */
                    
                    if (I2C_WCNT < 2) {
                        /* 書き込み終了していない場合 */
                        RTC_ERR |= 0x01;
                    } else {
                        /* 書き込み終了した場合 */
                        RTC_ERR = 0;
                    }
                } else {
                    /* 利用不可である場合 */
                    RTC_ERR |= 0x01;
                }
                
            }
            
            SBI_GenerateI2CStop(TSB_SBI0);/* ストップコンディションｾｯﾄ */
        }
        
        I2C_STATE = 3;/* 初回RTCレジスタ書込み終了 割り込みステートの変更 */
        
        /* ↓RTCの時刻読み込み処理↓ */
        T0BF0 = 0;/* 初期化アプリ作業領域のクリア */
        T0BF1 = 0;
        
        I2C_WCNT = 0;/* 初回書込みカウントを0リセット */
        I2C_RCNT = 0;/* 初回読込みカウントを0リセット */
        
        /* I2Cバス状態の確認を行う */
        if (RTC_ERR == 0) {
            /* 利用可能である場合 */
            i2c_state = SBI_GetI2CState(TSB_SBI0);/* I2Cバス状態取得 */
            if (i2c_state.Bit.BusState == 0) {
                /* I2Cバスの状態確認(利用可になるまで繰り返す) */
                SBI_SetSendData(TSB_SBI0, ((RTC_ADDR) | 0x00));/* ダミー書込み */
                SBI_GenerateI2CStart(TSB_SBI0);/* I2Cスタートさせる。送信終了後、割りこみ発生 */
                
                count01 = 0;/* カウントクリア */
                while (count01 < 5);/* 5ms待つ */
                count01 = 0;/* カウントクリア */
                while (count01 < 5);/* 5ms待つ */
                
                TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
                WDTCLR();/* WDT clear */
                count01 = 0;/* カウントクリア */
                
                i2c_state = SBI_GetI2CState(TSB_SBI0);/* I2Cバス状態取得 */
                if ((I2C_WCNT >= 2) && (i2c_state.Bit.BusState == 0)) {
                    /* ダミーライトできており、バスフリーである場合 */
                    SBI_SetSendData(TSB_SBI0, (RTC_ADDR | 0x01));/* スタート後、スレーブアドレスを送る。続いて読込み */
                    SBI_GenerateI2CStart(TSB_SBI0);/* I2Cスタート状態にさせる。送信終了後、割りこみ発生 */
                    
