ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DEVICEINI.c
                    count01 = 0;/* カウントクリア */
                    while (count01 < 5);/* 5ms待つ */
                    count01 = 0;/* カウントクリア */
                    while (count01 < 5);/* 5ms待つ */
                    
                    TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
                    WDTCLR();
                    count01 = 0;/* カウントクリア */
                    
                    if (T0BF1 == 1) {
                        /* 読出し完了した場合 */
                        RTC_ERR = 0;/* クリア */
                    } else {
                        /* 読出し未完了の場合 */
                        RTC_ERR |= 0x01;/* セット */
                    }
                } else {
                    /* 通信できない場合 */
                    RTC_ERR |= 0x01;/* セット */
                }
            } else {
                /* バスフリーにならない場合 */
                RTC_ERR |= 0x01;/* セット */
            }
            
        }
        
        SBI_SetI2CACK(TSB_SBI0, ENABLE);/* 読込みの最後でACKを無効化しているため、ここで有効にする */
        T0BF1 = 0;
        
        REG_00 = (RTCD_R[0] & 0x0F);
        REG_01 = ((RTCD_R[0] & 0xF0) >> 4) * 10;
        RTCDT[0] = REG_00 + REG_01;/* 秒　BCD→バイナリ変換 */
        
        REG_00 = (RTCD_R[1] & 0x0F);
        REG_01 = ((RTCD_R[1] & 0xF0) >> 4) * 10;
        RTCDT[1] = REG_00 + REG_01;/* 分　BCD→バイナリ変換 */
        
        REG_00 = (RTCD_R[2] & 0x0F);
        REG_01 = ((RTCD_R[2] & 0xF0) >> 4) * 10;
        RTCDT[2] = REG_00 + REG_01;/* 時　BCD→バイナリ変換 */
        
        REG_00 = (RTCD_R[4] & 0x0F);
        REG_01 = ((RTCD_R[4] & 0xF0) >> 4) * 10;
        RTCDT[4] = REG_00 + REG_01;/* 日　BCD→バイナリ変換 */
        
        REG_00 = (RTCD_R[5] & 0x0F);
        REG_01 = ((RTCD_R[5] & 0xF0) >> 4) * 10;
        RTCDT[5] = REG_00 + REG_01;/* 月　BCD→バイナリ変換 */
        
        REG_00 = (RTCD_R[6] & 0x0F);
        REG_01 = ((RTCD_R[6] & 0xF0) >> 4) * 10;
        RTCDT[6] = REG_00 + REG_01;/* 年　BCD→バイナリ変換 */
        
        RTC_VAL_CHK();/* 取り出した時刻がおかしくないかチェック */
        
        if (RTC_ERR > 0) {
            /* 一度でもバスフリーにならなかった、もしくは日付に異常が見られた場合 */
            if (((ABNF & 0x0F) == 0)
            || (((SYSFLG & 0x02) > 0) && ((ABNF & 0x0F) == 8))
            || (((SYSFLG & 0x02) > 0) && ((ABNF & 0x0F) == 9))
            || (((SYSFLG & 0x02) > 0) && ((ABNF & 0x0F) == 14))) {
                /* 異常になってない場合、又は運転中で常温水位電極棒異常である
                又は運転中で常温温度センサー異常である、又は真空度異常である場合 */
                ABNF &= 0x60;/* MASK */
                ABNF |= 0x8C;/* RTCエラーセット、ブザーオン */
                SYSFLG |= 0x40;/* パワーオンフラグセット */
                
            }
            
            if ((RTC_ERR & 0x02) > 0) {
                /* 読み込み日付がおかしい場合 */
                SETST_BUF[6] = RTCDT[6] = 21;/* 年 */
                SETST_BUF[5] = RTCDT[5] = 4;/* 月 */
                SETST_BUF[4] = RTCDT[4] = 1;/* 日 */
                SETST_BUF[2] = RTCDT[2] = 12;/* 時 */
                SETST_BUF[1] = RTCDT[1] = 0;/* 分 */
                WR_RTC  |= 0x01;/* 書込みの意をセット */
                
            }
            
            RTC_ERR  = 0;/* クリア */
            
        }
        
        /* 年月日から曜日を算出する */
        SETST_BUF[3] = RTCDT[3] = GETWEEKDAY(RTCDT[6], RTCDT[5], RTCDT[4]);/* 曜日セット */
        
        /* D/Aコンバーターの初期設定（内部リファレンス処理） */
        I2C_WCNT = 0;/* I2C書込み回数をｸﾘｱ */
        I2C_STATE = 4;/* I2C割り込みｽﾃｰﾄを初回用にする */
        SBI_GenerateI2CStop(TSB_SBI0);/* I2C通信のｽﾄｯﾌﾟをｾｯﾄ */
        
        /* I2C通信によるDAｺﾝﾊﾞｰﾀの初期化処理 */
        I2CBUF[0] = (DACN_ADDR | 0x00);/* DACｱﾄﾞﾚｽ(write)ｾｯﾄ */
        I2CBUF[1] = 0x6F;/* DAC_A/B共に内部ﾘﾌｧﾚﾝｽﾓｰﾄﾞに設定する */
        I2CBUF[2] = 0xFF;/* Don't Care 1ﾊﾞｲﾄｾｯﾄ */
        I2CBUF[3] = 0xFF;/* Don't Care 1ﾊﾞｲﾄｾｯﾄ */
        
        i2c_state = SBI_GetI2CState(TSB_SBI0);
        while (i2c_state.Bit.BusState) {
            /*I2Cバスの状態確認(利用可になるまで繰り返す)*/
            count01 = 0;/* クリア */
            while(count01 < 5);/* 5ms待つ */
            
            TSB_WD->CR = 0x0000004E;/* 内蔵WDTのクリアコードを書き込む */
            WDTCLR();
            SBI_GenerateI2CStop(TSB_SBI0);/* I2C通信のｽﾄｯﾌﾟをｾｯﾄ */
            i2c_state = SBI_GetI2CState(TSB_SBI0);
            
        }
        
        count01 = 0;/* タイマーカウントクリア */
        
        for (uint8_t i = 0;i < 10;i++) {
            /* 10回繰り返しﾙｰﾌﾟ構文 */
            I2C_WCNT = 1;
            SBI_SetSendData(TSB_SBI0, I2CBUF[0]);/* スタート後、DACアドレスを送る。書込み */
            SBI_GenerateI2CStart(TSB_SBI0);/* I2Cスタート状態にさせる。送信終了後、割りこみ発生 */
            
            for (uint8_t j = 0;j < 5;j++) {
                /* 10回繰り返しﾙｰﾌﾟ構文(約100ms待つ処理) */
                while (count01 < 5);/* 5ms待ちます */
                TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
                count01 = 0;/* カウントの0クリア */
                while (count01 < 5);/* 5ms待ちます */
                TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
                count01 = 0;
                while (count01 < 5);/* 5ms待ちます */
                TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
                count01 = 0;/* カウントの0クリア */
                while (count01 < 5);/* 5ms待ちます */
                TSB_WD->CR = 0x0000004E;/*WDTのクリアコードを書き込む*/
                count01 = 0;
                WDTCLR();/* 外付けウォッチドッグタイマーのクリア */
                
            }
            
            if (I2C_WCNT > 3) {
                /* 全てのﾃﾞｰﾀが送信完了した場合 */
                /* DAｺﾝﾊﾞｰﾀの内部ﾘﾌｧﾚﾝｽ処理完了 */
                SBI_GenerateI2CStop(TSB_SBI0);/* I2C通信のｽﾄｯﾌﾟをｾｯﾄ */
                I2C_WCNT  = 0;
                I2C_STATE = 5;/* I2C割り込みｽﾃｰﾄの変更 */
                break;
                
            } else {
                /* データが送信出来ていない場合 */
                SBI_GenerateI2CStop(TSB_SBI0);/* I2C通信のｽﾄｯﾌﾟをｾｯﾄ */
                I2C_WCNT = 0;
                i2c_state = SBI_GetI2CState(TSB_SBI0);
                
                while (i2c_state.Bit.BusState) {
                    /*I2Cバスの状態確認(利用可になるまで繰り返す)*/
                    count01 = 0;/* クリア */
                    while(count01 < 5);/* 5ms待つ */
                    
