ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DEVICEINI.c
                    TSB_WD->CR = 0x0000004E;/* 内蔵WDTのクリアコードを書き込む */
                    WDTCLR();
                    SBI_GenerateI2CStop(TSB_SBI0);/* I2C通信のｽﾄｯﾌﾟをｾｯﾄ */
                    i2c_state = SBI_GetI2CState(TSB_SBI0);
                    
                }
                
            }
            
        }
        
        NVIC_DisableIRQ(INTTB00_IRQn);/* タイマ割り込み不許可 */
        NVIC_DisableIRQ(INTSBI0_IRQn);/* I2C通信割り込み不許可 */
        
        count01 = 0;/* カウントクリア */
        kidou = 1;/* 起動完了ｾｯﾄ */
        D_INISQ = 1;/* 初回ﾃﾞｨｯﾌﾟｽｲｯﾁ取り込み、NV-RAM取り込み、RTC設定・時刻、DAｺﾝﾊﾞｰﾀ設定書込み完了ｾｯﾄ */
        INI_STT = 0;/* サブシーケンスクリア */
        
    } else {
        /* ～～～～～初期化完了後の処理～～～～～ */
        /* 共通処理 */
        if ((SYSFLG & 0x5E) == 0x40) {
            /* 運転待ち状態である場合 */
            if (RWTMS >= 240) {
                /* 60秒経過している場合 */
                RWTMS -= 240;/* 60秒を減算 */
                RWAITT++;/* 分をインクリメント */
                
                if (RWAITT >= 240) {
                    /* 4時間経過した場合 */
                    RWAITT = 0;/* 分をクリア */
                    SYSFLG &= 0xA1;/* パワーオフにする */
                    
                }
                
            }
            
        } else {
            /* 運転待ち状態ではない場合 */
            RWTMS = 0;
            RWAITT = 0;
            
        }
        
        SBI_I2CState i2c_state;/* I2Cバス状態を見る構造体に名前を付ける */
        
        STSFL0 |= 0x02;/* 初期化完了セット */
        
        if (D_INISQ == 1) {
            /* ～～～～～RTC読み出し処理～～～～～ */
            /* ここから分岐 */
            if (INI_STT == 0) {
                /* 初回 */
                I2C_STATE = 3;/* I2C割り込みステートの変更 */
                
                /* RTCの時刻読み込み処理 */
                T0BF0 = 0;/* 初期化アプリ作業領域のクリア */
                I2C_WCNT = 0;/* 初回書込みカウントを0リセット */
                I2C_RCNT = 0;/* 初回読込みカウントを0リセット */
                
                /* I2Cバス状態の確認を行う */
                for (uint8_t i = 0;i < 200;i++) {
                    i2c_state = SBI_GetI2CState(TSB_SBI0);/* I2Cバス状態取得 */
                    __NOP();
                    RTC_ERR |= 0x80;
                    
                    if (!i2c_state.Bit.BusState) {
                        /* 通信していない場合 */
                        RTC_ERR &= 0x7F;/* RTC異常クリア */
                        SBI_SetSendData(TSB_SBI0, ((RTC_ADDR) | 0x00));/* ダミー書込み */
                        SBI_GenerateI2CStart(TSB_SBI0);/* I2Cスタートさせる。送信終了後、割りこみ発生 */
                        
                        break;
                    } else if (i == 199) {
                        /* 最後までバスフリーを確認できなかった場合 */
                        I2C_RSTE();/* バスチェック・クリア */
                    }
                }
                
                INI_STT++;/* 次回の処理位置インクリメント */
                
                OS_LoadTime->NEXT_LOAD_Time[0] = 5;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[0] = 0xA0;/* 遅延フラグ建築 */
                
            } else if (INI_STT == 1) {
                /* ダミーライト終了確認 */
                if (I2C_WCNT > 1) {
                    /* ダミーライト待ち終わった際 */
                    for (uint8_t i = 0;i < 200;i++) {
                        i2c_state = SBI_GetI2CState(TSB_SBI0);/* I2Cバス状態の取得 */
                        __NOP();
                        RTC_ERR |= 0x80;
                        if (!i2c_state.Bit.BusState) {
                            /* I2Cバスの状態確認(バスが空きであれば) */
                            RTC_ERR &= 0x7F;/* RTC異常クリア */
                            SBI_SetSendData(TSB_SBI0, (RTC_ADDR | 0x01));/* スタート後、スレーブアドレスを送る。続いて読込み */
                            SBI_GenerateI2CStart(TSB_SBI0);/* I2Cスタート状態にさせる。送信終了後、割りこみ発生 */
                            break;
                            
                        }
                        
                    }
                    
                } else if (NACK5 > 5) {
                    /* NACKが5回に達した場合 */
                    SBI_GenerateI2CStop(TSB_SBI0);/* I2Cを停止させる */
                    RTC_ERR |= 0x80;/* RTC異常ｾｯﾄ */
                    
                } else {
                    /* 何もせず待つ */
                    SBI_GenerateI2CStop(TSB_SBI0);/* I2Cを停止させる */
                    RTC_ERR |= 0x80;/* RTC異常ｾｯﾄ */
                    
                }
                
                INI_STT++;/* 次回処理位置インクリメント */
                
                OS_LoadTime->NEXT_LOAD_Time[0] = 10;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[0] = 0xA0;/* 遅延フラグ建築 */
                
            } else if (INI_STT == 2) {
                /* 読み込み待ち状態 */
                if (I2C_RCNT >= 9) {
                    /* 読込み回数が読込み予定データ数を超えた場合 */
                    RTC_ERR &= 0x7F;/* 受信できたので一旦RTC異常をクリアする */
                    
                    SBI_SetI2CACK(TSB_SBI0, ENABLE);/* 読込みの最後でACKを無効化しているため、ここで有効にする */
                    
                    REG_00 = REG_01 = 0;/* 一旦クリア */
                    REG_00 = (RTCD_R[0] & 0x0F);
                    REG_01 = (RTCD_R[0] >> 4) * 10;
                    RTCDT[0] = (REG_00 + REG_01);/* 秒　BCD→バイナリ変換 */
                    
                    REG_00 = REG_01 = 0;/* 一旦クリア */
                    REG_00 = (RTCD_R[1] & 0x0F);
                    REG_01 = ((RTCD_R[1] & 0xF0) >> 4) * 10;
                    RTCDT[1] = (REG_00 + REG_01);/* 分　BCD→バイナリ変換 */
                    
                    REG_00 = REG_01 = 0;/* 一旦クリア */
                    REG_00 = (RTCD_R[2] & 0x0F);
                    REG_01 = ((RTCD_R[2] & 0xF0) >> 4) * 10;
                    RTCDT[2] = (REG_00 + REG_01);/* 時　BCD→バイナリ変換 */
                    
                    REG_00 = REG_01 = 0;/* 一旦クリア */
                    REG_00 = (RTCD_R[4] & 0x0F);
                    REG_01 = ((RTCD_R[4] & 0xF0) >> 4) * 10;
                    RTCDT[4] = (REG_00 + REG_01);/* 日　BCD→バイナリ変換 */
                    
                    REG_00 = REG_01 = 0;/* 一旦クリア */
                    REG_00 = (RTCD_R[5] & 0x0F);
                    REG_01 = ((RTCD_R[5] & 0xF0) >> 4) * 10;
                    RTCDT[5] = (REG_00 + REG_01);/* 月　BCD→バイナリ変換 */
                    
                    REG_00 = REG_01 = 0;/* 一旦クリア */
                    REG_00 = (RTCD_R[6] & 0x0F);
                    REG_01 = ((RTCD_R[6] & 0xF0) >> 4) * 10;
                    RTCDT[6] = (REG_00 + REG_01);/* 年　BCD→バイナリ変換 */
                    
                    RTC_VAL_CHK();/* RTCの値チェック実施 */
                    
                    if ((RTC_ERR & 0x02) > 0) {
                        /* データに異常があった場合 */
                        RTC_ECT++;/* カウントをインクリメント */
                        if (RTC_ECT >= 5) {
                            /* カウントが5以上になった場合 */
                            RTC_ERR |= 0x80;/* 時計IC自体だめフラグ */
                            RTC_ECT = 0;/* クリア */
                            
