ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DEVICEINI.c
                        }
                        
                    } else {
                        /* データに異常がない場合 */
                        RTC_ECT = 0;/* クリア */
                        RTC_ERR &= 0x7F;/* 時計IC問題なし */
                    }
                    
                    /* 年月日から曜日を算出する */
                    RTCDT[3] = GETWEEKDAY(RTCDT[6], RTCDT[5], RTCDT[4]);/* 曜日セット */
                    
                    
                    
                } else if (NACK5 >= 5) {
                    /* NACK回数が一定数を超えた場合 */
                    SBI_SetI2CACK(TSB_SBI0, ENABLE);/* 読込みの最後でACKを無効化しているため、ここで有効にする */
                    RTC_ERR |= 0x80;
                    
                } else {
                    /* それ以外の場合 */
                    SBI_SetI2CACK(TSB_SBI0, ENABLE);/* 読込みの最後でACKを無効化しているため、ここで有効にする */
                    RTC_ECT++;/* エラーカウントをインクリメント */
                    if (RTC_ECT >= 5) {
                        /* 5回以上失敗した場合 */
                        RTC_ECT = 0;/* 失敗回数クリア */
                        RTC_ERR |= 0x80;
                        
                    }
                    
                }
                
                /* 終了処理 */
                SBI_GenerateI2CStop(TSB_SBI0);/* I2Cを停止させる */
                INI_STT = 0;/* 次回処理位置を変更 */
                I2C_RCNT = I2C_WCNT = 0;/* 値をクリアする */
                T0BF0 = T0BF1 = 0;/* 予定数以上の受信をした事を検知したフラグをクリアする */
                
                if ((WR_RTC & 0x01) == 0x01) {
                    /* RTCの書き換えが発生した場合 */
                    D_INISQ = 4;/* RTC書き込みに切り替える */
                    
                } else {
                    /* RTCの書き換えが発生していない場合 */
                    D_INISQ = 2;/* NV-RAM書き込みに切り替える */
                    
                }
                
                OS_LoadTime->NEXT_LOAD_Time[0] = 15;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[0] = 0xA0;/* 遅延フラグ建築 */
                
            }
            
            if (RTC_ERR > 0) {
                /* 一度でもバスフリーにならなかった、もしくは日付に異常が見られた場合 */
                if (((ABNF & 0x0F) == 0)
                || (((SYSFLG & 0x02) > 0) && ((ABNF & 0x0F) == 8))
                || (((SYSFLG & 0x02) > 0) && ((ABNF & 0x0F) == 9))
                || (((SYSFLG & 0x02) > 0) && ((ABNF & 0x0F) == 14))) {
                    /* 異常になってない場合、又は運転中で常温水位電極棒異常である
                    又は運転中で常温温度センサー異常である、又は真空度異常である場合 */
                    ABNF &= 0x60;/* MASK */
                    ABNF |= 0x8C;/* RTCエラーセット、ブザーオン */
                    SYSFLG |= 0x40;/* パワーオンフラグセット */
                    
                }
                
                RTC_ERR = 0;
            }
            
        } else if (D_INISQ == 2) {
            /* ～～～～～NV-RAM書き込み処理～～～～～ */
            STSFL0 ^= 0x01;/* XOR　0ビット目 */
            if ((STSFL0 & 0x01) == 0) {
                /* NV-RAM書き込みタイミングである場合 */
                MOMCHK();/* メモリー検査 */
                KEEP();/* NV-RAMへバックアップ処理 */
                
            }
            
            D_INISQ = 3;/* DAC書き込みに切り替える */
            INI_STT = 0;/* 初期値にする */
            
            OS_LoadTime->NEXT_LOAD_Time[0] = 30;/* 次回呼び出し時間 */
            OS_LoadTime->TSK_COND[0] = 0xA0;/* 遅延フラグ建築 */
            
        } else if (D_INISQ == 3) {
            /* ～～～～～DAC書き込み処理～～～～～ */
            if (INI_STT == 0) {
                /* 送信ﾀｲﾐﾝｸﾞである場合 */
                I2C_STATE = 5;/* I2C割り込みステートの変更 */
                
                T0BF0 = 0;/* 初期化アプリ作業領域のクリア */
                I2C_WCNT = 0;/* 初回書込みカウントを0リセット */
                I2C_RCNT = 0;/* 初回読込みカウントを0リセット */
                
                i2c_state = SBI_GetI2CState(TSB_SBI0);/* I2Cバス状態取得 */
                
                for (uint8_t i = 0;i < 200;i++) {
                    /* 200回ループ */
                    if (!i2c_state.Bit.BusState) {
                        /* I2Cバスがバスフリーである場合 */
                        REG_00 = DACOUT;/* DAC出力用変数値をセットする */
                        
                        I2CBUF[0] = (DACN_ADDR | 0x00);/* DACｱﾄﾞﾚｽ(write)ｾｯﾄ */
                        I2CBUF[1] = 0x30;/* DAC_Aのレジスタに書き込む命令 */
                        I2CBUF[2] = (uint8_t)((0x0FF0 & REG_00) >> 4);/* DACに送る上位8ビットｾｯﾄ */
                        I2CBUF[3] = (uint8_t)((0x000F & REG_00) << 4);/* DACに送る下位4ビットｾｯﾄ */
                        
                        I2C_WCNT = 1;/* 送信前にカウントを加算する */
                        SBI_SetSendData(TSB_SBI0, I2CBUF[0]);/* スタート後、DACアドレスを送る。書込み */
                        SBI_GenerateI2CStart(TSB_SBI0);/* I2Cスタート状態にさせる。送信終了後、割りこみ発生 */
                        
                        break;/* ループを抜けます */
                        
                    } else {
                        /* I2Cバスがバスビジーである場合 */
                        SBI_GenerateI2CStop(TSB_SBI0);/* I2C通信のｽﾄｯﾌﾟをｾｯﾄ */
                        __NOP();
                        __NOP();
                        i2c_state = SBI_GetI2CState(TSB_SBI0);/* I2Cバス状態取得 */
                        
                    }
                    
                }
                
                INI_STT = 1;/* 処理シーケンスを次のシーケンスにする */
                
                OS_LoadTime->NEXT_LOAD_Time[0] = 15;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[0] = 0xA0;/* 遅延フラグ建築 */
                
            } else {
                /* 全送信完了確認タイミングである場合 */
                if (I2C_WCNT > 3) {
                    /* DAコンバータ書込みの全てのﾃﾞｰﾀが送信完了した場合 */
                    I2CCNT = 0;/* クリア */
                    
                } else {
                    /* データが送信出来ていない場合 */
                    I2CCNT++;/* 待ち時間ｲﾝｸﾘﾒﾝﾄ */
                    if (I2CCNT >= 5) {
                        /* 5回以上待ちぼうけの場合 */
                        I2CCNT = 5;/* 5でFIX */
                        I2C_RSTE();/* F-RAMリセット処理 */
                        
                    }
                    
                }
                
                SBI_GenerateI2CStop(TSB_SBI0);/* I2C通信のｽﾄｯﾌﾟをｾｯﾄ */
                I2C_WCNT = 0;/* 書込み回数クリア */
                I2C_STATE = 3;/* 次回割り込みステート変更 */
                INI_STT = 0;/* 初期値 */
                D_INISQ = 1;/* 次はRTC時刻読み込み */
                
                OS_LoadTime->NEXT_LOAD_Time[0] = 25;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[0] = 0xA0;/* 遅延フラグ建築 */
                
