ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DEVICEINI.c
            }
            
        } else if (D_INISQ == 4) {
            /* RTC書き込み処理 */
            if (INI_STT == 0) {
                /* 初回は書き込み処理 */
                I2C_STATE = 6;/* 割り込みステートの変更 */
                
                /* RTCの時刻読み込み処理 */
                T0BF0 = 0;/* 初期化アプリ作業領域のクリア */
                T0BF2 = 0;
                I2C_WCNT = 0;/* 書込みカウントを0リセット */
                I2C_RCNT = 0;/* 読込みカウントを0リセット */
                
                /* I2Cバス状態の確認を行う */
                for (uint8_t i = 0;i < 200;i++) {
                    i2c_state = SBI_GetI2CState(TSB_SBI0);/* I2Cバス状態取得 */
                    __NOP();/* NOP */
                    SBI_GenerateI2CStop(TSB_SBI0);/* I2Cを停止させる */
                    if (!i2c_state.Bit.BusState) {
                        /* I2Cバスが空きである場合 */
                        SBI_SetSendData(TSB_SBI0, ((RTC_ADDR) | 0x00));/* 書込みｾｯﾄ */
                        SBI_GenerateI2CStart(TSB_SBI0);/* I2Cスタートさせる。送信終了後、割りこみ発生 */
                        INI_STT++;/* 次回の処理位置インクリメント */
                        break;
                        
                    } else if (i == 199) {
                        /* 最後までバスフリーを検出できなかった場合 */
                        D_INISQ = 1;/* 時刻読み込み処理へ */
                        I2C_RSTE();/* バスチェック・クリア */
                    }
                    
                }
                
                OS_LoadTime->NEXT_LOAD_Time[0] = 15;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[0] = 0xA0;/* 遅延フラグ建築 */
                
            } else if (INI_STT == 1) {
                /* 書き込み待ち */
                if (I2C_WCNT > 6) {
                    /* 書き込み待ち終わった際 */
                    RTC_ERR &= 0x7F;/* エラーフラグをクリアする */
                    
                } else if (NACK5 >= 5) {
                    /* NACKが5回に達した場合 */
                    RTC_ERR |= 0x80;/* 時計IC自体だめフラグ */
                    SBI_GenerateI2CStop(TSB_SBI0);/* I2Cを停止させる */
                    
                } else {
                    /* 何もせず待つ */
                    RTC_ERR |= 0x80;/* 時計IC自体だめフラグ */
                    
                }
                
                /* 終了処理 */
                SBI_GenerateI2CStop(TSB_SBI0);/* I2Cを停止させる */
                INI_STT  = 0;/* 次回処理位置を変更 */
                I2C_WCNT = 0;/* 書き込み回数クリア */
                D_INISQ  = 2;/* NV-RAM書き込みに切り替える */
                WR_RTC  &= 0xFE;/* 時計書込み終了 */
                
                for (uint8_t i = 0;i < 7;i++) {
                    SETST_BUF[i] = 0;
                }
                
                OS_LoadTime->NEXT_LOAD_Time[0] = 15;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[0] = 0xA0;/* 遅延フラグ建築 */
                
            }
            
        }
        
        /* 初期化完了後の処理ここまで */
    }
    
    if (OS_LoadTime->NEXT_LOAD_Time[0] == 0) {
        /* 入力されていない場合 */
        OS_LoadTime->NEXT_LOAD_Time[0] = 20;/* 次回呼び出し時間 */
        OS_LoadTime->TSK_COND[0] = 0xA0;/* 遅延フラグ建築 */
        
    }
    
    return;
}

/**
 *題名：I2Cバスのリセットルーチン
 *作成者：浅尾　享一
 *説明：I2CバスのSDAラインがLow張り付きした場合、強制リセットを行う。
**/
void I2C_RSTE(void)
{
    
    if (TSB_PC_DATA_PC0 == 0) {
        /* PC0がLow張り付きであった場合 */
        /* SCLラインをカチカチする */
        for (uint8_t i=0;i<=9;i++) {
            TSB_PC_DATA_PC1 = 1;
            TSB_PC->CR &= 0xFE;/* PC0をHI-Zにする */
            for (uint8_t j=0;j<=5;j++) {
                __NOP();
            }
            TSB_PC->CR |= 0x01;
            TSB_PC_DATA_PC0 = 0;
            for (uint8_t j=0;j<=5;j++) {
                __NOP();
            }
            TSB_PC_DATA_PC1 = 0;
            for (uint8_t j=0;j<=5;j++) {
                __NOP();
            }
            TSB_PC->CR &= 0xFE;/* PG0をHI-Zにする */
            for (uint8_t j=0;j<=5;j++) {
                __NOP();
            }
            TSB_PC_DATA_PC1 = 1;
            for (uint8_t j=0;j<=5;j++) {
                __NOP();
            }
        }
        TSB_PC->CR |= 0x01;
    }
    
    return;
}

/**
 *題名：NV-RAMのデータ取得ルーチン
 *作成者：浅尾　享一
 *説明：初回、NV-RAMからデータを取得する
**/
void SETUP(void)
{
    for (uint8_t i = 0;i < 2;i++) {
        /* 2回確認を行います */
        ECMD(0x85);/* リコールコマンド(NV-RAMの内蔵E2PROMから内蔵RAMに読み出す処理) */
        
        TSB_PE_DATA_PE4 = 0;/* NV-RAM チップノットセレクト */
        TSB_PD->DATA &= 0xCF;/* DIとSKをクリア */
        
        count01 = 0;/* タイマクリア */
        while(count01 < 1);/* 1ms待ちます */
        
        ERD();/* 1度読み捨て */
        ERD();/* 2回目を採用 */
        
        if ((PASS1 == 0x01) && (PASS2 == 0xAA)) {
            /* パスワードOKである場合 */
            break;/* 抜けます */
            
        } else {
            /* パスワードが見つからない場合 */
            if (i == 1) {
                /* 2回目であった場合 */
                BLCLR();/* 初期値セットする */
                ABNF = 0x0D;/* NV-RAM異常 */
                ABNF |= 0x80;/* ブザーフラグセット */
                SYSFLG |= 0x40;/* 電源ONフラグセット */
                
            }
            
        }
    }
    
    return;/* 戻ります */
    
}

/**
 *題名：NV-RAM保存するメモリー状態の確認
 *作成者：浅尾　享一
 *説明：保存メモリーのチェックをしておかしければ初期値にする
**/
void MOMCHK(void)
{
    if ((PASS1 == 0x01) && (PASS2 == 0xAA)) {
        /* パスワードが設定されている場合 */
        /* 何もしない */
        
    } else {
        /* パスワードが設定されていない場合 */
        BLCLR();/* 初期値にする */
        ABNF = 0x0D;
        
    }
    
    return;/* 戻る */
    
}

/**
 *題名：NV-RAMへデータ保存するルーチン
 *作成者：浅尾　享一
 *説明：NV-RAMへデータを書き込み・保存する処理
**/
void KEEP(void)
{
    uint16_t REG_00 = 0;/* 一時バッファエリア */
    
    ECMD(0x84);/* 書き込み許可コマンドを送信 */
    
    TSB_PE_DATA_PE4 = 0;/* NV-RAM チップノットセレクト */
    TSB_PD->DATA &= 0xCF;/* DIとSKをクリア */
    
    for (uint8_t i = 0;i < 16;i++) {
        /* 16回繰り返し（16ワード分） */
        ECMD((0x83 | (i << 3)));/* NV-RAM書き込みコマンド */
        TSB_PE_DATA_PE4 = 1;/* NV-RAM チップセレクト */
        
        REG_00 = 0;/* 一旦クリア */
        REG_00 = (uint16_t)*HENNP[i * 2];/* セット */
        REG_00 |= ((uint16_t)*HENNP[(i * 2) + 1] << 8);/* セット */
        
