ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DEVICEINI.c
        for (uint8_t j = 0;j < 16;j++) {
            /* 16bit分繰り返し確認 */
            if ((REG_00 & 0x0001) > 0) {
                /* NV-RAMへ出力するデータがHighである場合 */
                TSB_PD_DATA_PD5 = 1;/* セット */
                
            } else {
                /* NV-RAMへ出力するデータがLowである場合 */
                TSB_PD_DATA_PD5 = 0;/* セット */
                
            }
            REG_00 >>= 1;/* 1ビット右シフト */
            
            /* クロックデータを出力 */
            TSB_PD_DATA_PD4 = 1;/* SKをHigh */
            for (uint8_t k = 0;k < 4;k++) {
                /* 少しだけ待ちます */
                __NOP();/* 待つ */
            }
            TSB_PD_DATA_PD4 = 0;/* SKをLow */
            __NOP();/* 待つ */
            
        }
        
        TSB_PE_DATA_PE4 = 0;/* NV-RAM チップノットセレクト */
        TSB_PD->DATA &= 0xCF;/* DIとSKをクリア */
        __NOP();/* 待つ */
        
    }
    
    return;
}

/**
 *題名：NV-RAMのコマンド書き込みルーチン
 *作成者：浅尾　享一
 *説明：初回、NV-RAMへコマンドを送信する
**/
void ECMD(uint8_t CoMD)
{
    TSB_PE_DATA_PE4 = 0;/* NV-RAM チップノットセレクト */
    TSB_PD->DATA &= 0xCF;/* DIとSKをクリア */
    
    TSB_PE_DATA_PE4 = 1;/* NV-RAM チップセレクト */
    
    for (uint8_t i = 0;i < 8;i++) {
        /* 8回ループする */
        /* まずはコマンドビットを出力する */
        if ((CoMD & 0x80) == 0) {
            /* コマンドの最上位ビットが0の場合 */
            TSB_PD_DATA_PD5 = 0;/* Low */
            
        } else {
            /* コマンドの最上位ビットが1の場合 */
            TSB_PD_DATA_PD5 = 1;/* High */
            
        }
        CoMD <<= 1;/* 1ﾋﾞｯﾄ左シフト */
        
        /* クロックデータを出力 */
        TSB_PD_DATA_PD4 = 1;/* SKをHigh */
        for (uint8_t j = 0;j < 4;j++) {
            /* 少しだけ待ちます */
            __NOP();/* 待つ */
        }
        TSB_PD_DATA_PD4 = 0;/* SKをLow */
        
    }
    
    return;/* 戻る */
}

/**
 *題名：NV-RAMからデータ読み出しルーチン
 *作成者：浅尾　享一
 *説明：初回、NV-RAMからデータを取り込む処理
**/
void ERD(void)
{
    uint16_t REG_00 = 0;/* ここでしか使わないもの定義 */
    
    TSB_PE_DATA_PE4 = 0;/* NV-RAM チップノットセレクト */
    TSB_PD->DATA &= 0xCF;/* DIとSKをクリア */
    
    for (uint8_t i = 0;i < 16;i++) {
        /* 16回繰り返し（16ワード分） */
        ECMD((0x86 | (i << 3)));/* NV-RAM読み出しコマンド */
        TSB_PE_DATA_PE4 = 1;/* NV-RAM チップセレクト */
        
        for (uint8_t j = 0;j < 16;j++) {
            /* 16bit分繰り返し確認 */
            REG_00 >>= 1;/* 1ビット右シフト */
            if (TSB_PD_DATA_PD6 == 1) {
                /* NV-RAMの出力データがHighである場合 */
                REG_00 |= 0x8000;/* セット */
                
            }
            
            /* クロックデータを出力 */
            TSB_PD_DATA_PD4 = 1;/* SKをHigh */
            for (uint8_t k = 0;k < 4;k++) {
                /* 少しだけ待ちます */
                __NOP();/* 待つ */
            }
            TSB_PD_DATA_PD4 = 0;/* SKをLow */
            __NOP();/* 待つ */
            
        }
        
        TSB_PE_DATA_PE4 = 0;/* NV-RAM チップノットセレクト */
        /* データを反映する */
        *HENNP[i * 2] = (uint8_t)REG_00;/* 下位セット */
        *HENNP[(i * 2) + 1] = (uint8_t)(REG_00 >> 8);/* 上位セット */
        
    }
    
    return;/* 戻る */
}

/**
 *題名：NV-RAMのデータ初期化ルーチン
 *作成者：浅尾　享一
 *説明：初回、NV-RAMのパスワードデータがおかしかった場合にデータをクリアする処理
**/
void BLCLR(void)
{
    for (uint8_t i = 0;i < 32;i++) {
        /* 32回繰り返し処理 */
        *HENNP[i] = 0;/* データをクリアする */
        
    }
    
    *HENNP[0] = 0x01;/* PASS1 */
    *HENNP[1] = 0xAA;/* PASS2 */
    *HENNP[4] = 0x0A;/* パターン1設定温度　10℃ */
    *HENNP[5] = 0x0A;/* パターン2設定温度　10℃ */
    *HENNP[6] = 0x0A;/* パターン3設定温度　10℃ */
    *HENNP[7] = 0x0A;/* パターン4設定温度　10℃ */
    *HENNP[9] = 20;/* 常温槽設定水温　20℃ */
    *HENNP[20] = 0;/* チラー予約時間（分）　0分 */
    *HENNP[21] = 8;/* チラー予約時間（時）　8時 */
    *HENNP[25] = 5;/* パターン1徐冷温度　5分 */
    *HENNP[26] = 5;/* パターン2徐冷温度　5℃ */
    *HENNP[27] = 5;/* パターン3徐冷温度　5分 */
    *HENNP[28] = 5;/* パターン4徐冷温度　5℃ */
    *HENNP[29] = 0;/* 現在のパターン選択値　0 */
    
    return;
    
}

/**
 *題名：RTCデータの正常性確認
 *作成者：浅尾　享一
 *説明：RTCから読み出した値が正常な値であるか判定する
**/
void RTC_VAL_CHK(void)
{
    if (RTCDT[0] > 59) {
        /* 秒数エラー */
        RTC_ERR |= 0x02;/* エラーセット */
        RTCDT[0] = 0;
    }
    
    if (RTCDT[1] > 59) {
        /* 分数エラー */
        RTC_ERR |= 0x02;/* エラーセット */
        RTCDT[1] = 0;
    }
    
    if (RTCDT[2] > 23) {
        /* 時数エラー */
        RTC_ERR |= 0x02;/* エラーセット */
        RTCDT[2] = 12;
    }
    
    if ((RTCDT[5] > 12) || (RTCDT[5] < 1)) {
        /* 月数エラー */
        RTC_ERR |= 0x02;/* エラーセット */
        RTCDT[5] = 4;
    }
    
    if (RTCDT[6] > 99) {
        /* 年数エラー */
        RTC_ERR |= 0x02;/* エラーセット */
        RTCDT[6] = 22;
    }
    
    if (
    (RTCDT[4] > 31) || (RTCDT[4] < 1)
    || ((RTCDT[4] > 30) && ((RTCDT[5] == 4) || (RTCDT[5] == 6) || (RTCDT[5] == 9) || (RTCDT[5] == 11)))
    || ((RTCDT[4] > (28 + (1 / (RTCDT[6] % 4 + 1)) * (1 - 1 / (RTCDT[6] % 100 + 1)) + (1 / (RTCDT[6] % 400 + 1))))
        && (RTCDT[5] == 2))
    ) {
        /* 日数エラー */
        RTC_ERR |= 0x02;/* エラーセット */
        RTCDT[4] = 1;
    }
    
    return;
}

/*
 年、月、日を指定すると、曜日を返す。(0:日～6:土)
*/
uint8_t GETWEEKDAY(uint8_t nYear, uint8_t nMonth, uint8_t nDay)
{
    int nWeekday, nTmp, Year2;
    
    Year2 = (2000 + nYear);/* 2000年加算 */
    if ((nMonth == 1) || (nMonth == 2)) {
        /* 1月、2月の場合 */
        Year2--;/* 年をﾃﾞｸﾘﾒﾝﾄ */
        nMonth += 12;/* 12ヶ月加算 */
    }
    
    nTmp     = (Year2 / 100);/* 年値を100で割った値をセット */
    nWeekday = ((Year2 + (Year2 >> 2) - nTmp + (nTmp >> 2) + (13 * (int)nMonth + 8) / 5 + (int)nDay) % 7);/* 曜日算出 */
    nWeekday &= 0x00000007;/* 必要な値のみをマスク */
    
    return (uint8_t)nWeekday;/* 1バイトでリターン */
}